<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"ad09863f0e546c82966f6fc29fe2bfe2c7c7f0eaafd5ae0421f22b6f9a5904f5","plan_job_ref":"Job .github/workflows/_test-tf.yaml #23 at https://github.com/DND-IT/github-workflows/actions/runs/14620469218","plan_out_hash":"a788e711821c7a96f40ec6498efccc7c0e3aa00d568151ffad357a175a52c570","plan_hash":"932b0b318560fcd54f969ea66b49661bc81dba1536bfa1f0df45498125c5bba5","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #23](https://github.com/DND-IT/github-workflows/actions/runs/14620469218)